In [1]:
import pandas as pd
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+pymysql://root:kazi@localhost:3306/pandas_sql')

In [2]:
df = pd.read_sql_table('customers',con=engine.connect())
df

   id    name phone_number
0   1    Kazi     50355314
1   2  Ejajul     89986765
2   3    Robi     76543223
3   4    Nabi     76564323

In [15]:
df = pd.read_sql_table('customers', con=engine.connect(), columns=["name"])
df

     name
0    Kazi
1  Ejajul
2    Robi
3    Nabi

In [21]:
# query = '''
# SELECT 
# pandas_sql.customers.name, 
# pandas_sql.customers.phone_number, 
# pandas_sql.orders.name, 
# pandas_sql.orders.amount
# FROM pandas_sql.customers 
# INNER JOIN pandas_sql.orders
# ON pandas_sql.customers.id=pandas_sql.orders.customer_id
# '''
# pd.read_sql(query,con=engine.connect())

In [22]:
pd.read_sql("customers",con=engine.connect())

   id    name phone_number
0   1    Kazi     50355314
1   2  Ejajul     89986765
2   3    Robi     76543223
3   4    Nabi     76564323

In [24]:
df = pd.read_csv("data/customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [28]:
df.info(verbose=False, memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Columns: 2 entries, name to phone_number
dtypes: int64(1), object(1)
memory usage: 592.0 bytes

In [25]:
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace=True)
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [27]:
df.to_sql(
    name='customers',
    con=engine,
    if_exists='append',
    index=False
)

6